import { ScriptItem } from '../types';

export const outsideAvatar: ScriptItem = {
    id: 'outside-avatar',
    title: '외부 아바타 주입기',
    subtitle: '롤20 용량과 관계 없이 이미지 링크로 아바타 이미지 변경이 가능합니다.',
    description: '주요 기능Roll20의 아트 라이브러리 용량을 소모하지 않고, 외부 이미지 URL을 통해 캐릭터 아바타를 즉시 변경합니다.',
    author: 'R',
    version: '1.0',
    updatedAt: '2026. 01. 13.',
    content: {
        introduction: `사용자의 브라우저에서만 바뀌는 것이 아니라, Roll20 서버의 캐릭터 속성을 직접 수정하므로 설치하지 않은 다른 플레이어들에게도 변경된 아바타가 정상적으로 노출됩니다.
            
설치 및 설정 방법

1. 확장 프로그램 설치
제공된 확장 프로그램 폴더(ZIP)를 다운로드하고 압축을 해제합니다.
크롬 브라우저에서 chrome://extensions/ 주소로 이동합니다.
우측 상단의 [개발자 모드]를 활성화합니다.
좌측 상단의 [압축해제된 확장 프로그램을 로드합니다] 버튼을 클릭하여 해제한 폴더를 선택합니다.

2. 실행 확인
Roll20 캠페인 페이지를 새로고침합니다.
우측 사이드바의 저널 탭을 클릭하면 최상단에 [이미지 외부에서 가져오기] 버튼이 생성됩니다.
`,
        usage: {
            description: `1. 사이드바 상단의 [이미지 외부에서 가져오기] 버튼을 클릭합니다.
2. 대상 캐릭터 이름: 아바타를 변경할 캐릭터 저널의 이름을 정확히 입력합니다. (대소문자 및 띄어쓰기 포함)
3. 이미지 주소: 디스코드 링크나 Imgur 등 외부 이미지의 주소를 입력합니다. (뒤가 PNG여야 인식이 되는 것으로 확인했습니다.) Base64 방식도 가능하나 조금 불안정합니다.
4. 확인: 성공 메시지가 뜨면 해당 캐릭터 시트를 닫았다가 다시 열어 변경된 아바타를 확인합니다.`,
            images: [
                "/images/avatar.gif"
            ]
        }
    },
    code: `유료 전환 예정의 확장 프로그램이기에 이 사이트에서 배포하지 않습니다.
아래 링크를 참고해 주세요.

https://posty.pe/47fs9m`,
};
