import { ScriptItem } from '../types';

export const roommanager: ScriptItem = {
    id: 'roommanager',
    title: '세팅 zip 내보내기/가져오기 확장 프로그램',
    subtitle: '페이지 세팅, 토큰 설정, 저널, 시트 정보, 핸드아웃, 조명, 덱 정보 이동 가능',
    description: '롤20 룸의 세팅 정보 zip 컨버터 확장 프로그램',
    author: 'O',
    version: '2.0',
    updatedAt: '2026. 01. 18.',
    content: {
        introduction: `정식 명칭은 Roll20 Room Manager입니다.
어쩔 수 없습니다(예시 gif의 경우 1.78MB). 내보내기는 빠른 편이지만 불러오기는 느립니다. 바로 되지 않으니 인내심을 가지고 기다려 주세요. 개인적인 생각입니다만 핸드아웃이 많은 룰이나 카드를 많이 쓰는 룰 등에서 편리할 듯합니다.정말로 롤20에서 롤20간의 정보 이전만을 지원합니다. 이미지를 전부 본인의 라이브러리에 올리는 형식이니 zip파일을 불러올 때는 용량에 주의하세요. 전부 webp로 경량화해 이미지 파일의 크기를 절감하는 방식을 채택하고 있습니다만 규격 외의 이미지는 
하나의 플랫폼일 뿐입니다. 여러분의 많은 사용과 배포 부탁드립니다.컨버터는 
코드 더 낫게 고칠 수 있으면 그렇게 고쳐서 쓰시면 됩니다. 재배포도 상관 없습니다. 버그 리포트나 개선사항은 괘념치 말고 바로바로 말씀 주세요.`,
        usage: {
            description: `내보내기: 세팅된 방에서 확장 프로그램 아이콘을 눌러 매니저 열기, 내보내기 클릭.
가져오기: zip 원본이 만들어진 방과 같은 시트를 사용해 빈 방을 만듭니다. 직후 확장 프로그램 아이콘을 눌러 매니저 열기, 가져오기 클릭. 그리고 인고의 시간을 가지시면 됩니다.`,
            images: [
                ""
            ]
        }
    },
    code: `이곳에서 배포하고 있지 않습니다.
https://posty.pe/e49vk9`,
};
