import { ScriptItem } from '../types';

export const visual: ScriptItem = {
    id: 'visual',
    title: 'Roll20 비주얼 노벨 오버레이',
    subtitle: '저와 친구들은 RUS20, 룻20이라고 부르고 있습니다.',
    description: 'https://tobe.aladin.co.kr/n/557490',
    author: 'R',
    version: '1.0',
    updatedAt: '2026. 01. 18.',
    content: {
        introduction: `확장 프로그램은 비공식 도구이며 Roll20과 공식적인 관련이 없습니다.
 하는 기능에 대한 것은 아래 구글 폼으로 접수 부탁드립니다. 어느 정도 모였을 때에 버전 업그레이드 생각 있습니다. 오류는 제 트위터 DM 부탁드립니다.개선점, 더 추가했으면
롤20 화이팅!

+문의가 들어와 적습니다. 해당 기능은 롤20 라이브러리를 전혀 사용하지 않습니다. 또한 이미지 링크의 경우 컴퓨터의 저장 공간을 거의 차지하지 않고, 이미지의 경우도 압축하기 때문에 용량 걱정은 않으셔도 괜찮습니다.(기왕 하는 거 이미지 링크가 오래 쓸 수 있긴 해요.) 롤20 용량은 걱정 않으셔도 됩니다.

투비에서 사주시면 제가 돈을 조금 더 법니다. 파일은 같습니다.
https://tobe.aladin.co.kr/n/557490


주요 기능
캐릭터별 스탠딩 이미지와 표정을 설정할 수 있으며 실시간 표정 변경이 가능합니다.
보관함 시스템을 통해 설정을 저장하고 불러올 수 있으며, 최대 500개의 백업을 저장할 수 있습니다.`,
        usage: {
            description: `1. 확장 프로그램 설치
제공된 확장 프로그램 폴더(ZIP)를 다운로드하고 압축을 해제합니다.
좌측 상단의 [압축해제된 확장 프로그램을 로드합니다] 버튼을 클릭하여 해제한 폴더를 선택합니다.

2. 실행 확인
확장 프로그램 아이콘을 클릭하면 설정 창이 열립니다.

3. 기본 설정
`,
            images: [
                ""
            ]
        }
    },
    code: `
확장프로그램이라 아래에서 배포하고 있습니다.
전문은 아래에.
https://www.postype.com/@mylifeomg/post/21377500`,
};
